package com.example.dotaautochessguide.Model;

import com.example.dotaautochessguide.R;

import java.util.Arrays;
import java.util.List;

public class Data {
    //棋子圖片宣告
    public static List<Integer> ChampionsImage = Arrays.asList(R.drawable.head_1,R.drawable.head_2,R.drawable.head_3,R.drawable.head_4,R.drawable.head_5,R.drawable.head_6,R.drawable.head_7,R.drawable.head_8,R.drawable.head_9,R.drawable.head_10,R.drawable.head_11,R.drawable.head_12,R.drawable.head_13,R.drawable.head_14,R.drawable.head_15,R.drawable.head_16,R.drawable.head_17,R.drawable.head_18,R.drawable.head_19,R.drawable.head_20,R.drawable.head_21,R.drawable.head_22,R.drawable.head_23,R.drawable.head_24,R.drawable.head_25,R.drawable.head_26,R.drawable.head_27,R.drawable.head_28,R.drawable.head_29,R.drawable.head_30,R.drawable.head_31,R.drawable.head_32,R.drawable.head_33,R.drawable.head_34,R.drawable.head_35,R.drawable.head_36,R.drawable.head_37,R.drawable.head_38,R.drawable.head_39,R.drawable.head_40,R.drawable.head_41,R.drawable.head_42,R.drawable.head_43,R.drawable.head_44,R.drawable.head_45,R.drawable.head_46,R.drawable.head_47,R.drawable.head_48,R.drawable.head_49,R.drawable.head_50,R.drawable.head_51,R.drawable.head_52,R.drawable.head_53,R.drawable.head_54,R.drawable.head_55);
    public static List<Integer> RaceImage = Arrays.asList(R.drawable.race_1,R.drawable.race_2,R.drawable.race_3,R.drawable.race_4,R.drawable.race_5,R.drawable.race_6,R.drawable.race_7,R.drawable.race_8,R.drawable.race_9,R.drawable.race_10,R.drawable.race_11,R.drawable.race_12,R.drawable.race_13);
    public static List<Integer> JobImage = Arrays.asList(R.drawable.job_1,R.drawable.job_2,R.drawable.job_3,R.drawable.job_4,R.drawable.job_5,R.drawable.job_6,R.drawable.job_7,R.drawable.job_8,R.drawable.job_9,R.drawable.job_10);
    public static List<Integer> SkillImage = Arrays.asList(R.drawable.skill_1,R.drawable.skill_2,R.drawable.skill_3,R.drawable.skill_4,R.drawable.skill_5,R.drawable.skill_6,R.drawable.skill_7,R.drawable.skill_8,R.drawable.skill_9,R.drawable.skill_10,R.drawable.skill_11,R.drawable.skill_12,R.drawable.skill_13,R.drawable.skill_14,R.drawable.skill_15,R.drawable.skill_16,R.drawable.skill_17,R.drawable.skill_18,R.drawable.skill_19,R.drawable.skill_20,R.drawable.skill_21,R.drawable.skill_22,R.drawable.skill_23,R.drawable.skill_24,R.drawable.skill_25,R.drawable.skill_26,R.drawable.skill_27,R.drawable.skill_28,R.drawable.skill_29,R.drawable.skill_30,R.drawable.skill_31,R.drawable.skill_32,R.drawable.skill_33,R.drawable.skill_34,R.drawable.skill_35,R.drawable.skill_36,R.drawable.skill_37,R.drawable.skill_38,R.drawable.skill_39,R.drawable.skill_40,R.drawable.skill_41,R.drawable.skill_42,R.drawable.skill_43,R.drawable.skill_44,R.drawable.skill_45,R.drawable.skill_46,R.drawable.skill_47,R.drawable.skill_48,R.drawable.skill_49,R.drawable.skill_50,R.drawable.skill_51,R.drawable.skill_52,R.drawable.skill_53,R.drawable.skill_54,R.drawable.skill_55);
    public static List<Integer> ChampionsLevel = Arrays.asList(1,1,1,1,1,1,1,1,1,1,1,1,
            2,2,2,2,2,2,2,2,2,2,2,2,2,2,
            3,3,3,3,3,3,3,3,3,3,3,3,3,
            4,4,4,4,4,4,4,4,4,4,4,
            5,5,5,5,5);
    //棋子資料宣告
    public static List<String> ChampionsName = Arrays.asList("赤斧酋長","海象王","獨角獸","冰霜騎士","背叛者","不眠遊俠","刺魂者","霸天者","轟天者","禁忌獵魔人","食人魔法師","岩之靈",
            "劍客","獨眼獵手","絕命巫醫","海淵守衛","魔力之源","光鱗龍","撕裂者","煉獄騎士","水之靈","盤羊騎士","慧語先知","靈刃騎士","扭木賢者","魅影女王",
            "暗影魔王","墮落獵魔人","雷之靈","沙地之主","邪靈騎士","魔化毒蟲","焰靈法師","狼人","海淵夜行者","幽影夜行者","逐風遊俠","毒液","矮人火槍手",
            "利爪","靈魂收割者","龜甲長老","海盜船長","龍騎士","光羽刺客","末日審判官","海妖","狂戰士","萃毒者","風暴薩滿",
            "毀滅者","海嘯追獵者","暗之靈","凋零法師","矮人直升機");
    public static List<String> ChampionsEngName = Arrays.asList("赤斧酋長","海象王","獨角獸","冰霜騎士","背叛者","不眠遊俠","刺魂者","霸天者","轟天者","禁忌獵魔人","食人魔法師","岩之靈",
            "劍客","獨眼獵手","絕命巫醫","海淵守衛","魔力之源","光鱗龍","撕裂者","煉獄騎士","水之靈","盤羊騎士","慧語先知","靈刃騎士","扭木賢者","魅影女王",
            "暗影魔王","墮落獵魔人","雷之靈","沙地之主","邪靈騎士","魔化毒蟲","焰靈法師","狼人","海淵夜行者","幽影夜行者","逐風遊俠","毒液","矮人火槍手",
            "利爪","靈魂收割者","龜甲長老","海盜船長","龍騎士","光羽刺客","末日審判官","海妖","狂戰士","萃毒者","風暴薩滿",
            "毀滅者","海嘯追獵者","暗之靈","凋零法師","矮人直升機");
    public static List<String> ChampionsHp = Arrays.asList("700/1400/2800","650/1300/2600","400/800/1500","500/1000/2000","550/1100/2200","400/800/1600","550/1100/2200","700/1400/2800","500/1000/2000","500/1000/2000","700/1400/2800","650/1300/2600","600/1200/2400","600/1200/2400","550/1100/2200","650/1300/2600","450/900/1800","450/900/1800","800/1600/3200","750/1500/3000","550/1100/2200","700/1400/2800","500/1000/1900","500/1000/2000","650/1300/2300","550/1100/2200","450/900/1800","650/1300/2600","750/1500/3000","550/1100/2200","750/1500/3000","500/1000/2000","550/1100/2200","750/1500/3000","500/1000/2000","550/1100/2200","550/1100/2200","550/1100/2200","450/900/1800","800/1600/3200","850/1700/3400","650/1300/2600","950/1900/3800","800/1600/3200","750/1500/3000","1050/2100/4200","750/1500/3000","900/1800/3600","1000/2000/4000","700/1400/2800","1000/2000/3000","950/1900/3800","1000/2000/3000","850/1700/3400","900/1800/3600");
    public static List<String> ChampionsArmor = Arrays.asList("5","5","5","5","5","5","5","5/7/9","5","5","5","5","5","5","5","5","5","5","6/8/10","5","5","10","0","5","5","0","5","5","5","10","10","0","5","5","0","5","5","5","5","0","5","5","10","10","5","5","5","5","5","5","5","5","5","5","15");
    public static List<String> ChampionsAttackSpeed = Arrays.asList("1.5","1.2s","1.5s","1.3s","1.6s","1.3s","1s","1.4s","1.5s","1.2s","1.4s","1.9s","1.1s","1.1s","1.4s","1.2s","1.7s","1.7s","1.4s","1.3s","1.3s","1.4s","1.4s","1.3s","2s","1.2s","1.1s","1.4s","1.1s","1.4s","1.3s","1.2s","1.6s","1.1s","0.9s","1.2s","0.9s","1s","1.1s","1.3s","1.2s","1.7s","1.3s","1.2s","1.2s","1.3s","1s","1.1s","1s","1.5s","1.5s","2s","1.5s","1.5s","0.9s");
    public static List<String> ChampionsDamage = Arrays.asList("50/100/200","50/100/200","50/100/200","40/80/160","40/80/160","45/90/180","50/100/200","45/90/180","40/80/160","45/90/180","55/110/220","60/120/240","65/130/260","60/120/240","40/80/160","70/140/280","40/80/160","45/90/180","55/110/220","40/80/160","45/90/180","55/110/220","45/90/180","50/100/200","60/120/240","55/115/230","70/140/280","55/110/220","55/110/220","50/100/200","50/100/200","50/100/200","52/105/210","50/100/200","50/100/200","80/160/320","55/110/220","55/110/220","65/130/260","50/100/200","50/100/200","40/80/60","75/150/300","50/100/200","100/200/400","110/220/440","50/100/200","90/180/360","50/100/200","45/90/180","50/100/200","45/90/180","45/90/180","40/80/160","75/150/300");
    public static List<String> ChampionsRace = Arrays.asList("洞洞族","野獸","野獸","冰川族","冰川族","不眠","哥布林","哥布林","哥布林","光羽族","基拉","靈族","洞洞族","洞洞族","冰川族","海族","人族","龍族,光羽族","哥布林","惡魔","靈族","人族","光羽族","光羽族","光羽族","惡魔","惡魔","惡魔","靈族","野獸","不眠","野獸","人族","人族,野獸","海族","光羽族","光羽族","龍族","矮人族","野獸","不眠","人族","人族","人族,龍族","光羽族","惡魔","海族","冰川族","哥布林","洞洞族","哥布林","海族","靈族","不眠","矮人族");
    public static List<String> ChampionsJob = Arrays.asList(
            "戰士","戰士","德魯伊","騎士","薩滿","獵人","刺客","工匠","工匠","惡魔獵手","法師","戰士","戰士",
            "獵人","術士","戰士","法師","法師","工匠","騎士","刺客","騎士","德魯伊","騎士","德魯伊","刺客",
            "術士","惡魔獵手","法師","刺客","騎士","術士","法師","戰士","刺客","刺客","獵人","刺客","獵人",
            "德魯伊","術士","法師","戰士","騎士","刺客","戰士","獵人","戰士","術士","薩滿",
            "工匠","獵人","術士","法師","工匠");
    public static List<String> ChampionsSkill = Arrays.asList(
            "嘲諷","北海神拳","治癒","碎雪炸彈","變形術","射手遺志","麻痺飛鏢","彈慕衝擊","追蹤導彈","銷魂","激怒","投擲",
            "旋風斬","旋風斧","彈跳藥劑","侵蝕","喚醒","光影","死亡收割","煉獄箭","海浪沖擊","勝光洗禮","自然之力","月影刃","生命之種","魔音",
            "影之歌","魔化","閃電新星","流沙穿刺","白骨之盾","瘟疫守衛","神滅斬","解放獸性","隱匿","幽影之擊","穿雲箭","劇毒攻擊","爆頭",
            "熊靈夥伴","竭心脉冲","龜派氣功","幽靈船","共鳴","TA力場","末世詛咒","凝視","狂熱","化學狂暴","離子風暴",
            "延時炸彈","毀滅之觸","凋零","凋零法球","空中打擊");
    public static List<String> ChampionsSkillIntro = Arrays.asList( //一費棋子說明
            "獲得5護甲並強迫1格範圍敵方棋子攻擊自己,持續2秒","下次普攻造成4倍傷害並使敵方棋子被擊飛1秒",
            "每1.5秒治療3格內隨機的7個友方棋子25生命，持續11秒",
            "使2格範圍區域內敵方棋子在20秒內移動間隔延長1秒且被冰霜騎士攻擊時額外受到50魔法傷害,最多可疊加4層",
            "將一個隨機敵方棋子變成無法攻擊和使用技能的青蛙,持續4秒",
            "提高自身20%攻擊力和20%攻擊速度",
            "向一個隨機敵方棋子投擲飛鏢造成300魔法傷害和0.1秒眩暈。",
            "每0.7秒對2格內隨機的1個敵方棋子造成50魔法傷害和0.1秒眩暈，持續5秒。",
            "發射3枚導彈分別對1個隨機敵方棋子造成200魔法傷害",
            "每次攻擊損毀敵方棋子30魔法值並造成損毀值50%的額外物理傷害。",
            "使一個隨機己方棋子攻速提高30%，持續30秒。",
            "將1格內的1個隨機敵方棋子拋向最遠的格子並對其造成100物理傷害和1.5秒眩暈。",
            "每秒對附近1格內敵方棋子造成50魔法傷害，持續5秒。",
            "丟出飛斧對路徑上的敵方棋子造成60物理傷害並在接下來的5秒內對其造成傷害提高10%。",
            "丟出在敵方棋子間最多彈跳5次的藥劑，造成75傷害和1秒眩暈",
            "使1個隨機敵方棋子護甲降低15，持續20秒。",
            "2秒為友方棋子增加8魔法值",
            "發射殘影對路徑上的敵方棋子造成150魔法傷害",
            "對附近2格內的敵方棋子造成150純粹傷害",
            "對1個隨機敵方棋子造成50到200的隨機魔法傷害和1到2秒的隨機眩暈。",
            "沖向最遠的敵方棋子身後並對路徑上的敵方棋子造成150魔法傷害。",
            "治療1個友方棋子250生命值並對其周圍2格範圍內的敵方棋子造成250純粹傷害。",
            "在棋盤邊緣隨機的格子中召喚1個弱小的樹人協助戰鬥。",
            "普攻會在敵方棋子間彈射彈射最多3次,每次彈射傷害遞減30%。",
            "使1個隨機敵方棋子每秒受到37.5魔法傷害並根據傷害治療附近3格內友方棋子，持續0.1秒。",
            "對周圍3格範圍敵方棋子造成200魔法傷害。",
            "向四周釋放6道沖擊波對敵方棋子造成100魔法傷害。",
            "和1個友方棋子互換生命值並變身，變為遠程攻擊並提高50攻擊力和50%攻速，,持續60秒。",
            "釋放逐漸擴散至3格範圍的等離子場對敵方棋子造成10到100傷害,距離越遠傷害越高。",
            "鑽入地下並沖向最遠的敵方棋子身後對路徑上的敵方棋子造成150魔法傷害和0.6秒眩暈。",
            "為1個友方棋子添加一個持續10秒且最多吸收100傷害的護盾，護盾失效時對附近3格範圍內敵方棋子造成等同於吸收傷害量的魔法傷害。",
            "召喚1個免疫魔法傷害且攻擊使敵方棋子在5秒內攻速降低30%的瘟疫守衛。",
            "對1個隨機敵方棋子造成500魔法傷害。",
            "變形為狼並獲得20%生命加成，同時召喚2隻狼攻擊敵方棋子。",
            "每秒恢复3%生命值并隐身,持续4秒。",
            "普攻有10%概率造成3倍傷害。",
            "蓄力最多2秒並射出箭矢對路徑上的敵方棋子造成最多400魔法傷害，每穿過1名敵方棋子傷害降低-10%。",
            "使1個隨機敵方棋子每秒受到150魔法傷害並降低40%攻速，持續5秒",
            "鎖定一個敵方棋子並在蓄力1秒後對其造成400魔法傷害。",
            "召喚一個普攻有25%機率纏繞敵方棋子3秒的熊靈協助戰鬥。",
            "对3格范围内的敌方棋子造成100魔法伤害,并为范围内友方棋子恢复100生命。",
            "蓄力最多3秒後發射衝擊波對路徑上的敵方棋子最多造成300魔法傷害。",
            "召喚幽靈船撞擊目標區域對其中敵方棋子造成150傷害和1.4秒眩暈。",
            "變為龍使射程增加2格、攻擊力提高100，普攻使敵方棋子受到持續魔法傷害。",
            "免疫4次傷害並提高40攻擊力，持續6秒。",
            "沉默1個敵方棋子並使其每秒受到60純粹傷害，持續10秒。",
            "使4格範圍內面向自己的敵方棋子攻速降低30%，持續4秒，期間持續面向自己超過2秒的敵方棋子會被石化2秒。",
            "連續攻擊同一敵方棋子時攻速提高15%，最多疊加6層嗎，更換目標時重置。",
            "進入狂暴使攻擊間隔降低至0.7且每秒恢復40生命值，持續60秒。",
            "創造風暴沉默範圍內敵方棋子並造成最高每秒100魔法傷害，持續2秒",
            "埋設3秒後引爆的炸藥桶對4格範圍內的敵方棋子造成700物理傷害。",
            "召喚觸手對3格範圍內的敵方棋子造成150魔法傷害並眩暈2秒。",
            "對3範圍區域內敵方棋子造成每秒5%最大生命值的純粹傷害，持續10秒。",
            "發射在敵方棋子間最多彈射6次的法球造成200魔法傷害並使其在2.5秒內攻速降低65%。",
            "召喚2枚導彈轟炸4格範圍區域，每枚導彈造成200魔法傷害。");

    public static List<String> RaceIntro = Arrays.asList(
            "(2)所有友方洞洞族最大生命值+200\n(4)所有友方洞洞族最大生命值+300\n",
            "(2)所有敵人護甲-4\n(4)所有敵人護甲-6",
            "(3)隨機友軍+15生命回復與護甲\n(6)全體友軍+15生命回復與護甲\n",
            "(2)冰川族友軍+35%攻速\n(4)所有友軍+30%攻速",
            "(2)全體魔抗+30\n(4)全體魔抗+30",
            "(2)全體友軍攻擊提升10%\n(4)全體友軍攻擊提升15%\n(6)全體友軍攻擊提升20%",
            "(3)所有友方光羽族迴避提升20%機率迴避攻擊\n(6)所有友方光羽有25%機率迴避攻擊",
            "(2)人族攻擊使敵人有沉默4秒\n(4)人類攻擊使人沉默4秒提升25%\n(6)人類攻擊使人沉默4秒提升30%",
            "(3)所有龍族開場時魔力100",
            "(2)靈族友方被攻擊時,30%石化敵人4秒\n(4)靈族友方被攻擊時,30%石化敵人4秒\n",
            "唯一,自身攻擊提升50%真傷",
            "唯一,自身最大生命提升10%",
            "唯一,自身攻擊距離提升300");

    public static List<String> JobIntro =Arrays.asList(
            "(3)自身護甲+7\n(6)自身護甲+8\n(9)自身護甲+9",
            "(2)兩隻1星可直接合上2星\n(4)兩隻2星可直接合上3星",
            "(2)所有敵人魔抗-40\n(4)所有敵人魔抗-40",
            "(3)自身攻擊+30%且攻擊+30%必中\n(6)自身攻擊+30%且攻擊+40%必中\n",
            "(3)友方刺客+10%機率造成3倍傷害\n(6)友方刺客+15%機率造成4倍傷害\n(6)友方刺客+20%造成5倍傷害",
            "(2)所有友方工匠的生命恢復速度+15/s\n(4)所有友方工匠的生命恢復速度+25/s",
            "(2)每3秒友方騎士傷害減免時間+30%\n(4)每3秒友方騎士傷害減免時間+30%\n(6)每3秒友方騎士傷害減免時間+30%",
            "(3)全體友軍攻擊吸血+15%\n(6)全體友軍攻擊吸血+25%",
            "(2)戰鬥開始時將1個隨機的敵方棋子變為青蛙，持續6秒 ",
            "(1)視為敵方1個惡魔單位\n");
    public static List<Integer> ItemsImage = Arrays.asList(R.drawable.image25,R.drawable.image26,R.drawable.image27,R.drawable.image28,R.drawable.image29,R.drawable.image30,R.drawable.image31,R.drawable.image32,R.drawable.image33,R.drawable.image34,R.drawable.image35,R.drawable.image36,R.drawable.image37,R.drawable.image38,R.drawable.image39,R.drawable.image40,R.drawable.image41,R.drawable.image42,R.drawable.image43,R.drawable.image44,R.drawable.image45,R.drawable.image46,R.drawable.image47,R.drawable.image48,R.drawable.image49,R.drawable.image50,R.drawable.image51,R.drawable.image52,R.drawable.image53,R.drawable.image54,R.drawable.image55,R.drawable.image56,R.drawable.image57,R.drawable.image58,R.drawable.image59,R.drawable.image60,R.drawable.image61,R.drawable.image62,R.drawable.image63,R.drawable.image64,R.drawable.image65,R.drawable.image66,R.drawable.image67,R.drawable.image68,R.drawable.image69);
    public static List<String> ItemsName = Arrays.asList("牛皮甲","生命之戒","魔能晶石","飲血面具","白骨爪","精靈頭飾","披肩","恢復指環","魔血晶石","木棍","盾牌","抗魔披風","鋼板甲","斷劍","生命晶石","魔能法杖","符文石鎚","魚叉","幽冥精粹","龍血巨斧","灌魔面具","幽魂利刃","冥魂碎片","神秘魔杖","恢復之球","魔晶劍","龍骨盾","瘋狂面具","雷電之鎚","刃甲","屠魔斗篷","巫毒法杖","冥魂魔晶","魔血利斧","蠻荒戰甲","萬鈞神棍","衝擊法杖1","衝擊法杖2","衝擊法杖3","衝擊法杖4","衝擊法杖5","魔龍之心","刷新球","雷鳴重錘","龍骨大砲","驚魂電鋸","邪惡鐮刀");
    public static List<String> ItemsIntro = Arrays.asList("+5護甲","+10生命回復","造成傷害時魔法恢復提高100%","+5%吸血效果","+10攻擊力","造成傷害時魔法恢復提高50%","使被攻擊的敵人-20%魔法抗性,持續5秒","+5每秒生命恢復","使被攻擊的敵人-3護甲.持續5秒","+5攻擊力 +10%攻擊速度","100%機率格黨10點傷害","+15%魔法抗性","+10護甲","+20攻擊","+250生命值","使被攻擊的敵人魔法抗性-30%,持續5秒","+15攻擊力","+15攻擊力","+250生命值,受到傷害時獲得法力值+25%","+500生命值 +10每秒生命恢復","+50攻擊","+30攻擊","+30%攻擊速度","使被攻擊的敵人魔法抗性-40%,持續5秒,造成傷害時獲得法力值+100%","+10生命恢復 造成傷害時法力值+100%","+15攻擊力,攻擊時有15%機率造成1.5倍傷害","+250最大生命值,+10生命恢復,50%機率格檔50傷害","+10%吸血效果,+40%攻擊速度,沉默自己","+25攻擊力,攻擊時25%機率對至多3個敵人造成100傷害","+5護甲.+10攻擊力,反彈敵人造成20%的傷害","+15每秒生命恢復,+30%魔法抗性","使被攻擊的敵人魔法抗性-100%,持續5秒","+70%攻擊速度","+30攻擊力,使被攻擊的敵人護甲-15,持續5秒","周圍1個友軍護甲+10,攻速+15,周圍1格敵軍護甲-10,攻速-15","+80%攻擊力,+10%攻擊速度","使被攻擊的敵人魔法抗性-30%，持續5秒，造成傷害時獲得的法力值+50%,主動技：對一個隨機敵方棋子造成400魔法傷害，15秒冷卻時間","使被攻擊的敵人魔法抗性-30%，持續5秒，造成傷害時獲得的法力值+50%,主動技：對一個隨機敵方棋子造成400魔法傷害，15秒冷卻時間","使被攻擊的敵人魔法抗性-90%，持續5秒，造成傷害時獲得的法力值+50%,主動技：對一個隨機敵方棋子造成600魔法傷害，9秒冷卻時間","使被攻擊的敵人魔法抗性-90%，持續5秒，造成傷害時獲得的法力值+50%,主動技：對一個隨機敵方棋子造成600魔法傷害，9秒冷卻時間","使被攻擊的敵人魔法抗性-90%，持續5秒，造成傷害時獲得的法力值+50%,主動技：對一個隨機敵方棋子造成600魔法傷害，9秒冷卻時間","+1000最大生命值,每2秒恢復1%最大生命值","+20生命恢復,造成傷害時獲得的法力值+200%，使用技能時刷新技能冷卻時間，每30秒觸發1次","+50攻擊力,+30攻擊速度,D48攻擊時有25%概率對最多5個敵人造成200傷害","+40攻擊力,攻擊時有10%概率造成4倍傷害","+150攻擊力","使被攻擊的敵人魔法抗性-20，持續5秒，受到和造成傷害時獲得的法力值+50%，生命值+250,主動：使一個隨機敵方棋子變為動物，持續5秒，30秒冷卻時間");
}
